Reports/ЛБ_ОтчетПоИндивидуальнымУсловиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ОтчетПоИндивидуальнымУсловиям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ОтклонениеОтБазовойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ОтклонениеОтБазовойЦены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Относительное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_ОтчетПоИндивидуальнымУсловиям/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИндивидуальныеУсловия";
	
	Макет = Отчет.РеквизитМакет;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаОтчета = Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	Результат.Вывести(ОбластьШапка);

	//Для каждого Стр Из РезультатЗапроса Цикл
	Если ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
		ДействующийПриказ = НайтиДействующийПриказ(ДатаКон, Отчет.Залогодатель);

		Если ДействующийПриказ = Неопределено Тогда
			ОбластьНетУсловий = Макет.ПолучитьОбласть("СтрокаНетУсловий");
			Результат.Вывести(ОбластьНетУсловий);
			
			Возврат;
		КонецЕсли;
		
		//Заполняем таблицу залогодателя
		//ДатаРождения = ПолучитьДатуРожденияЗалогодателя(ДатаКон, Стр.Залогодатель);
		//ДатаНачалаДействия = ДействующийПриказ[0].ДатаНачалаДействия;
		ДатаИФИО = "" + ?(НачалоДня(ДействующийПриказ[0].ДатаНачалаДействия) > НачалоДня(ДействующийПриказ[0].ДатаДокумента), ДействующийПриказ[0].ДатаНачалаДействия, ДействующийПриказ[0].ДатаДокумента)
			+ " " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДействующийПриказ[0].Приказ.Ответственный.Сотрудник.Наименование);
		//Пока нет этого поля
		//Основание = "";
		//
		ДатаОкончанияДействия = Дата(1,1,1);
		
		ПрСтавки = "";
		ПрМеталлы = "";
		ПрВставки = "";
		
		ЕстьПустаяДата = Ложь;
		
		Для каждого Стр Из ДействующийПриказ Цикл
			Если Стр.Ставки И ПрСтавки = "" Тогда
				ПрСтавки = Стр.Приказ;
			КонецЕсли;
			
			Если Стр.Металлы И ПрМеталлы = "" Тогда
				ПрМеталлы = Стр.Приказ;
			КонецЕсли;
			
			Если Стр.Вставки И ПрВставки = "" Тогда
				ПрВставки = Стр.Приказ;
			КонецЕсли;
			
			Основание = ?(СокрЛП(Основание) = "", "", ", ");
			Основание = Основание + Стр.Приказ.ОснованиеПриказа;
			
			Если Стр.ДатаОкончанияДействия = Дата(1,1,1) Тогда
				ЕстьПустаяДата = Истина;
			Иначе
				ДатаОкончанияДействия = Макс(ДатаОкончанияДействия, Стр.ДатаОкончанияДействия);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПустаяДата Тогда
			ДатаОкончанияДействия = Дата(1,1,1);
		КонецЕсли;
		
		//ОбластьЗаголовокЗ = Макет.ПолучитьОбласть("ЗаголовокЗ");
		//Результат.Вывести(ОбластьЗаголовокЗ);
		//
		//ОбластьСтрокаЗ = Макет.ПолучитьОбласть("СтрокаЗ");
		//ОбластьСтрокаЗ.Параметры.ФИОЗаемщика = Отчет.Залогодатель;
		//ОбластьСтрокаЗ.Параметры.ДатаРождения = ПолучитьДатуРожденияЗалогодателя(ДатаКон, Отчет.Залогодатель);;
		//ОбластьСтрокаЗ.Параметры.ДатаНачалаДействияСтатуса = ДействующийПриказ[0].ДатаНачалаДействия;
		//ОбластьСтрокаЗ.Параметры.ДатаОкончанияДействияСтатуса = ?(ДатаОкончанияДействия = Дата(1,1,1), "-", ДатаОкончанияДействия);
		//ОбластьСтрокаЗ.Параметры.ДатаПрисвоенияФИОИсполнителя = ДатаИФИО;
		//ОбластьСтрокаЗ.Параметры.Основание = Основание;
		//
		//Результат.Вывести(ОбластьСтрокаЗ);
		
		ОбластьШапкаЗ = Макет.ПолучитьОбласть("ШапкаЗ");
		ОбластьШапкаЗ.Параметры.ФИОЗаемщика = Отчет.Залогодатель;
		ОбластьШапкаЗ.Параметры.ДатаРождения = ПолучитьДатуРожденияЗалогодателя(ДатаКон, Отчет.Залогодатель);;
		ОбластьШапкаЗ.Параметры.ДатаНачалаДействияСтатуса = ДействующийПриказ[0].ДатаНачалаДействия;
		ОбластьШапкаЗ.Параметры.ДатаОкончанияДействияСтатуса = ?(ДатаОкончанияДействия = Дата(1,1,1), "-", ДатаОкончанияДействия);
		ОбластьШапкаЗ.Параметры.ДатаПрисвоенияФИОИсполнителя = ДатаИФИО;
		ОбластьШапкаЗ.Параметры.Основание = Основание;
		
		Результат.Вывести(ОбластьШапкаЗ);
		
		//Подготавливаем данные для заполнения условий
		МассивУдаленияСтрок = Новый Массив;
		
		Если ПрСтавки <> "" Тогда
			ТЗСтавки = ПрСтавки.СтавкиПроцентов.Выгрузить();
			МассивУдаленияСтрок.Очистить();
			
			Для каждого СтрС Из ТЗСтавки Цикл
				Если СтрС.Ставка = 0 Тогда
					МассивУдаленияСтрок.Добавить(СтрС);
				КонецЕсли;			
			КонецЦикла;
			
			Если МассивУдаленияСтрок.Количество() > 0 Тогда
				Для каждого СтрМ Из МассивУдаленияСтрок Цикл
					ТЗСтавки.Удалить(СтрМ);
				КонецЦикла;
			КонецЕсли;
			
			ТЗСКСтавки = ТЗСтавки.Скопировать(, "СхемаКредитования");
			ТЗСКСтавки.Свернуть("СхемаКредитования");
			ТЗСКСтавки.Сортировать("СхемаКредитования Возр");
			
		КонецЕсли;
		
		Если ПрМеталлы <> "" Тогда
			ТЗМеталлы = ПрМеталлы.НастройкаОтклоненийОтБазовыхЦенМеталлы.Выгрузить();
			
			МассивУдаленияСтрок.Очистить();
			
			Для каждого СтрМ Из ТЗМеталлы Цикл
				Если НЕ ЗначениеЗаполнено(СтрМ.ОтклонениеОтБазовойЦены) Тогда
					МассивУдаленияСтрок.Добавить(СтрМ);
				КонецЕсли;
			КонецЦикла;
			
			Если МассивУдаленияСтрок.Количество() > 0 Тогда
				Для каждого СтрМ Из МассивУдаленияСтрок Цикл
					ТЗМеталлы.Удалить(СтрМ);
				КонецЦикла;
			КонецЕсли;
			
			ТЗСКМеталлы = ТЗМеталлы.Скопировать(, "СхемаКредитования");
			ТЗСКМеталлы.Свернуть("СхемаКредитования");
			ТЗСКМеталлы.Сортировать("СхемаКредитования Возр");
			
		КонецЕсли;
		
		Если ПрВставки <> "" Тогда
			ТЗВставки = ПрВставки.НастройкаОтклоненийОтБазовыхЦенВставки.Выгрузить();
			
			ТЗСКВставки = ТЗВставки.Скопировать(, "СхемаКредитования");
			ТЗСКВставки.Свернуть("СхемаКредитования");
			ТЗСКВставки.Сортировать("СхемаКредитования Возр");
		КонецЕсли;
		
		//Заполняем ставки
		Если ПрСтавки = "" Тогда
			ОбластьШапкаС = Макет.ПолучитьОбласть("ШапкаС");
			ОбластьШапкаС.Параметры.Приказ = " - не установлены.";
			Результат.Вывести(ОбластьШапкаС);
		Иначе
			ОбластьШапкаС = Макет.ПолучитьОбласть("ШапкаС");
			ОбластьШапкаС.Параметры.Приказ = ". Приказ № " + ПрСтавки.НомерПриказа + " от " + Формат(ПрСтавки.Дата, "ДФ=dd.MM.yyyy")
			+ ", действует с " + Формат(ПрСтавки.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy")
			+ ?(ПрСтавки.ДатаОкончанияДействияПриказа = Дата(1,1,1), "", " по " + Формат(ПрСтавки.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy"));
			Результат.Вывести(ОбластьШапкаС);
			
			Для каждого СтрСК Из ТЗСКСтавки Цикл
				ОтборСК = Новый Структура;
				ОтборСК.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
				
				СтрокиС = ТЗСтавки.НайтиСтроки(ОтборСК);
				
				Если СтрокиС.Количество() > 0 Тогда
					//Добавляем колонки заголовка
					Инд = 1;
					
					Для каждого СтрС Из СтрокиС Цикл
						Если Инд = 1 Тогда
							ОбластьЗаголовокС = Макет.ПолучитьОбласть("ЗаголовокС|КолонкаЗаголовокС");
							ОбластьЗаголовокС.Параметры.СК = СтрС.СхемаКредитования.Наименование; //СтрС.СхемаКредитования.НаименованиеДляПечати;
							ОбластьЗаголовокС.Параметры.Диапазон = СтрС.ДиапазонСумм;
							Результат.Вывести(ОбластьЗаголовокС);
							Инд = Инд + 1;
						Иначе
							ОбластьЗаголовокС = Макет.ПолучитьОбласть("ЗаголовокС|КолонкаДопС");
							ОбластьЗаголовокС.Параметры.Диапазон = СтрС.ДиапазонСумм;
							Результат.Присоединить(ОбластьЗаголовокС);
						КонецЕсли;
					КонецЦикла;
					
					//Обединяем заголовок
					НомерСтр = Результат.ВысотаТаблицы;
					Результат.Область(НомерСтр - 2, 1, НомерСтр - 2, СтрокиС.Количество()).Объединить();
					
					//Добавляем колонки строк
					Инд = 1;
					
					Для каждого СтрС Из СтрокиС Цикл
						Если Инд = 1 Тогда
							ОбластьСтрокаС = Макет.ПолучитьОбласть("СтрокаС|КолонкаЗаголовокС");
							ОбластьСтрокаС.Параметры.Ставка = СтрС.Ставка;
							Результат.Вывести(ОбластьСтрокаС);
							Инд = Инд + 1;
						Иначе
							ОбластьСтрокаС = Макет.ПолучитьОбласть("СтрокаС|КолонкаДопС");
							ОбластьСтрокаС.Параметры.Ставка = СтрС.Ставка;
							Результат.Присоединить(ОбластьСтрокаС);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Заполняем металлы
		Если ПрМеталлы = "" Тогда
			ОбластьШапкаМ = Макет.ПолучитьОбласть("ШапкаМ");
			ОбластьШапкаМ.Параметры.Приказ = " - не установлены.";
			Результат.Вывести(ОбластьШапкаМ);
		Иначе
			ОбластьШапкаМ = Макет.ПолучитьОбласть("ШапкаМ");
			ОбластьШапкаМ.Параметры.Приказ = ". Приказ № " + ПрМеталлы.НомерПриказа + " от " + Формат(ПрМеталлы.Дата, "ДФ=dd.MM.yyyy")
			+ ", действует с " + Формат(ПрМеталлы.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy")
			+ ?(ПрМеталлы.ДатаОкончанияДействияПриказа = Дата(1,1,1), "", " по " + Формат(ПрМеталлы.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy"));
			Результат.Вывести(ОбластьШапкаМ);
			
			Для каждого СтрСК Из ТЗСКМеталлы Цикл
				ОтборСК = Новый Структура;
				ОтборСК.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
				
				ТЗМетСК = ТЗМеталлы.Скопировать(ОтборСК,);
				
				Если ТЗМетСК.Количество() > 0 Тогда
					ОтборОтклонение = Новый Структура;
					ОтборОтклонение.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное);
					
					ТЗОтн = ТЗМетСК.Скопировать(ОтборОтклонение,);
					
					ТаблицаМеталловОтн = ТЗОтн.Скопировать();
					ТаблицаМеталловОтн.Свернуть("КатегорияОбъектаЗалога, Металл, ЗначениеОтклонения, СхемаКредитования");
					
					ОтборОтклонение = Новый Структура;
					ОтборОтклонение.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное);
					
					ТЗАбс = ТЗМетСК.Скопировать(ОтборОтклонение,);
					
					ТаблицаМеталловАбс = ТЗАбс.Скопировать();
					ТаблицаМеталловАбс.Свернуть("КатегорияОбъектаЗалога, Металл, ЗначениеОтклонения, СхемаКредитования");
					
					Если ТЗОтн.Количество() > 0 Тогда
						ТЗОтнМет = ТЗОтн.Скопировать();
						ТЗОтнМет.Свернуть("Металл");
						ТЗОтнМет.Сортировать("Металл Возр");
						
						
						ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМ|КолонкаЗаголовок");
						ОбластьЗаголовокМеталлы.Параметры.СК = СтрСК.СхемаКредитования.Наименование;
						Результат.Вывести(ОбластьЗаголовокМеталлы);
						
						//Заполняем шапку заголовка таблицы
						НомерКолонки = 2;
						Для каждого СтрМетОтн Из ТЗОтнМет Цикл
							ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМ|КолонкаДоп");
							
							Если НомерКолонки = 2 Тогда
								ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в % от базовой оценки";
							КонецЕсли;
							
							ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетОтн.Металл.Наименование;
							Результат.Присоединить(ОбластьЗаголовокМеталлыДоп);
							
							НомерКолонки = НомерКолонки + 1;
						КонецЦикла;
						
						НомерСтр = Результат.ВысотаТаблицы;
						
						//Подготавливаем ТЗ для заполнения строк
						Если ТЗОтнМет.Количество() > 1 Тогда
							//Результат.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗОтнМет.Количество()).Объединить();
							Результат.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки).Объединить();

							ПромежуточнаяТабМет = ТаблицаМеталловОтн.Скопировать();

							КоличествоМеталлов = ТЗОтнМет.Количество();
							
							ТЗРезультат = ПромежуточнаяТабМет.Скопировать(,"КатегорияОбъектаЗалога, ЗначениеОтклонения");
							ТЗРезультат.Очистить();
							
							Для Сч = 0 По КоличествоМеталлов - 1 Цикл
								Отбор = Новый Структура;
								Отбор.Вставить("Металл", ТЗОтнМет[Сч].Металл);
								
								Если ТЗРезультат.Количество() = 0 Тогда
									ТЗРезультат = ПромежуточнаяТабМет.Скопировать(Отбор,);
									ТЗРезультат.Сортировать("КатегорияОбъектаЗалога Возр");
								Иначе
									ПромежуточнаяТабМет2 = ПромежуточнаяТабМет.Скопировать(Отбор,);
									ПромежуточнаяТабМет2.Сортировать("КатегорияОбъектаЗалога Возр");
									
									//Добавляем колонку в которую потом загрузим данные нового металла
									ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование);
									
									Для каждого СтрПромежуточная Из ПромежуточнаяТабМет2 Цикл
										НайденнаяСтр = ТЗРезультат.Найти(СтрПромежуточная.КатегорияОбъектаЗалога, "КатегорияОбъектаЗалога");
										
										Если НайденнаяСтр = Неопределено Тогда
											НаяСтр = ТЗРезультат.Добавить();
											НаяСтр.КатегорияОбъектаЗалога = СтрПромежуточная.КатегорияОбъектаЗалога;
											НаяСтр["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
										Иначе
											НайденнаяСтр["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						Иначе
							ТЗРезультат = ТаблицаМеталловОтн.Скопировать();
						КонецЕсли;
						
						//Заполняем строки
						Для каждого СтрРез Из ТЗРезультат Цикл
							ОбластьСтрокаМеталлы = Макет.ПолучитьОбласть("СтрокаМ|КолонкаЗаголовок");
							ОбластьСтрокаМеталлыДоп = Макет.ПолучитьОбласть("СтрокаМ|КолонкаДоп");
							
							ОбластьСтрокаМеталлы.Параметры.Категория = СтрРез.КатегорияОбъектаЗалога;
							Результат.Вывести(ОбластьСтрокаМеталлы);					
							
							Если ТЗОтнМет.Количество() > 1 Тогда
								КоличествоМеталлов = ТЗОтнМет.Количество();
								Для Сч = 0 По КоличествоМеталлов - 1 Цикл
									Если Сч = 0 Тогда
										ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									Иначе
										ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + ТЗОтнМет[Сч].Металл.Наименование];
									КонецЕсли;
									
									Результат.Присоединить(ОбластьСтрокаМеталлыДоп);
								КонецЦикла;
							Иначе
								ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
								Результат.Присоединить(ОбластьСтрокаМеталлыДоп);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если ТЗАбс.Количество() > 0 Тогда
						
						ТЗАбсМет = ТЗАбс.Скопировать();
						ТЗАбсМет.Свернуть("Металл");
						ТЗАбсМет.Сортировать("Металл Возр");
						
						ОбластьЗаголовокМеталлы = Макет.ПолучитьОбласть("ЗаголовокМ|КолонкаЗаголовок");
						ОбластьЗаголовокМеталлы.Параметры.СК = СтрСК.СхемаКредитования.Наименование;
						Результат.Вывести(ОбластьЗаголовокМеталлы);
						
						//Заполняем шапку заголовка таблицы
						НомерКолонки = 2;
						Для каждого СтрМетАбс Из ТЗАбсМет Цикл
							ОбластьЗаголовокМеталлыДоп = Макет.ПолучитьОбласть("ЗаголовокМ|КолонкаДоп");
							
							Если НомерКолонки = 2 Тогда
								ОбластьЗаголовокМеталлыДоп.Параметры.Отклонение = "Увеличение суммы оценки за грамм драгоценного металла в руб. от базовой оценки";
							КонецЕсли;
							
							ОбластьЗаголовокМеталлыДоп.Параметры.Металл = СтрМетАбс.Металл.Наименование;
							Результат.Присоединить(ОбластьЗаголовокМеталлыДоп);
							
							НомерКолонки = НомерКолонки + 1;
						КонецЦикла;
						
						НомерСтр = Результат.ВысотаТаблицы;
						
						//Подготавливаем ТЗ для заполнения строк
						Если ТЗАбсМет.Количество() > 1 Тогда
							//Результат.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки + ТЗАбсМет.Количество()).Объединить();
							Результат.Область(НомерСтр - 2, 3, НомерСтр - 1, НомерКолонки).Объединить();

							ПромежуточнаяТабМет = ТаблицаМеталловАбс.Скопировать();

							КоличествоМеталлов = ТЗАбсМет.Количество();
							
							ТЗРезультат = ПромежуточнаяТабМет.Скопировать(,"КатегорияОбъектаЗалога, ЗначениеОтклонения");
							ТЗРезультат.Очистить();
							
							Для Сч = 0 По КоличествоМеталлов - 1 Цикл
								Отбор = Новый Структура;
								Отбор.Вставить("Металл", ТЗАбсМет[Сч].Металл);
								
								Если ТЗРезультат.Количество() = 0 Тогда
									ТЗРезультат = ПромежуточнаяТабМет.Скопировать(Отбор,);
									ТЗРезультат.Сортировать("КатегорияОбъектаЗалога Возр");
								Иначе
									ПромежуточнаяТабМет2 = ПромежуточнаяТабМет.Скопировать(Отбор,);
									ПромежуточнаяТабМет2.Сортировать("КатегорияОбъектаЗалога Возр");
									
									//Добавляем колонку в которую потом загрузим данные нового металла
									ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование);
									
									Для каждого СтрПромежуточная Из ПромежуточнаяТабМет2 Цикл
										НайденнаяСтр = ТЗРезультат.Найти(СтрПромежуточная.КатегорияОбъектаЗалога, "КатегорияОбъектаЗалога");
										
										Если НайденнаяСтр = Неопределено Тогда
											НаяСтр = ТЗРезультат.Добавить();
											НаяСтр.КатегорияОбъектаЗалога = СтрПромежуточная.КатегорияОбъектаЗалога;
											НаяСтр["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
										Иначе
											НайденнаяСтр["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование] = СтрПромежуточная.ЗначениеОтклонения;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						Иначе
							ТЗРезультат = ТаблицаМеталловАбс.Скопировать();
						КонецЕсли;
						
						//Заполняем строки
						Для каждого СтрРез Из ТЗРезультат Цикл
							ОбластьСтрокаМеталлы = Макет.ПолучитьОбласть("СтрокаМ|КолонкаЗаголовок");
							ОбластьСтрокаМеталлыДоп = Макет.ПолучитьОбласть("СтрокаМ|КолонкаДоп");
							
							ОбластьСтрокаМеталлы.Параметры.Категория = СтрРез.КатегорияОбъектаЗалога;
							Результат.Вывести(ОбластьСтрокаМеталлы);					
							
							Если ТЗАбсМет.Количество() > 1 Тогда
								КоличествоМеталлов = ТЗАбсМет.Количество();
								Для Сч = 0 По КоличествоМеталлов - 1 Цикл
									Если Сч = 0 Тогда
										ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									Иначе
										ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + ТЗАбсМет[Сч].Металл.Наименование];
									КонецЕсли;
									
									Результат.Присоединить(ОбластьСтрокаМеталлыДоп);
								КонецЦикла;
							Иначе
								ОбластьСтрокаМеталлыДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
								Результат.Присоединить(ОбластьСтрокаМеталлыДоп);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Заполняем вставки
		Если ПрВставки = "" Тогда
			ОбластьШапкаВ = Макет.ПолучитьОбласть("ШапкаВ");
			ОбластьШапкаВ.Параметры.Приказ = " - не установлены.";
			Результат.Вывести(ОбластьШапкаВ);
		Иначе
			ОбластьШапкаВ = Макет.ПолучитьОбласть("ШапкаВ");
			ОбластьШапкаВ.Параметры.Приказ = ". Приказ № " + ПрВставки.НомерПриказа + " от " + Формат(ПрВставки.Дата, "ДФ=dd.MM.yyyy")
			+ ", действует с " + Формат(ПрВставки.ДатаНачалаДействияПриказа, "ДФ=dd.MM.yyyy")
			+ ?(ПрВставки.ДатаОкончанияДействияПриказа = Дата(1,1,1), "", " по " + Формат(ПрВставки.ДатаОкончанияДействияПриказа, "ДФ=dd.MM.yyyy"));
			Результат.Вывести(ОбластьШапкаВ);
			
			Для каждого СтрСК Из ТЗСКВставки Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ВидВставки", Справочники.ЛБ_ДрагоценныеКамни.Бриллиант);
				Отбор.Вставить("СхемаКредитования", СтрСК.СхемаКредитования);
				Отбор.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное);
				
				ТЗОтнСК = ТЗВставки.Скопировать(Отбор,);
				
				ТЗОтн = ТЗОтнСК.Скопировать();
				
				ТЗОтнСК.Свернуть("СхемаКредитования");
				ТЗОтнСК.Сортировать("СхемаКредитования Возр");
				
				Отбор.Вставить("ОтклонениеОтБазовойЦены", Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное);
				
				ТЗАбсСК = ТЗВставки.Скопировать(Отбор,);
				
				ТЗАбс = ТЗАбсСК.Скопировать();
				
				ТЗАбсСК.Свернуть("СхемаКредитования");
				ТЗАбсСК.Сортировать("СхемаКредитования Возр");
				
				МассивУдаления = Новый Массив;
				
				Если ТЗОтнСК.Количество() > 0 Тогда
					
					//Заполняем Текст и ТЧ относительно вида отклонений
					Для каждого СтрОтнСК Из ТЗОтнСК Цикл
						//Отбор = Новый Структура;
						//Отбор.Вставить("СхемаКредитования", СтрОтнСК.СхемаКредитования);
						
						ТЗОтнВст = ТЗОтн.Скопировать();
						
						ОбластьЗаголовокВставки = Макет.ПолучитьОбласть("ЗаголовокВ|КолонкаЗаголовок");
						ОбластьЗаголовокВставки.Параметры.СК = СтрСК.СхемаКредитования.Наименование;
						Результат.Вывести(ОбластьЗаголовокВставки);
						
						НомерКолонки = 2;
						Для каждого СтрВстОтн Из ТЗОтнВст Цикл
							ОбластьЗаголовокВставкиДоп = Макет.ПолучитьОбласть("ЗаголовокВ|КолонкаДоп");
							
							Если НомерКолонки = 2 Тогда
								ОбластьЗаголовокВставкиДоп.Параметры.Отклонение = "Увеличение суммы оценки за 1 карат в % от базовой оценки";
							КонецЕсли;
							
							ОбластьЗаголовокВставкиДоп.Параметры.Качество = СтрВстОтн.КачествоОгранки.Наименование;
							ОбластьЗаголовокВставкиДоп.Параметры.ВидОгранки = СтрВстОтн.ВидОгранки.Наименование;
							Результат.Присоединить(ОбластьЗаголовокВставкиДоп);
							
							НомерКолонки = НомерКолонки + 1;
						КонецЦикла;
						
						НомерСтр = Результат.ВысотаТаблицы;
						
						МассивУдаления.Очистить();
						
						//Подготовка данных для заполнения строк
						Если ТЗОтнВст.Количество() > 1 Тогда

							//Результат.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки + ТЗОтнВст.Количество()).Объединить();
							Результат.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки).Объединить();
							
							ПромежуточнаяТабВст = ТЗОтнВст.Скопировать();
							
							КоличествоКамней = ТЗОтнВст.Количество();
							
							ТЗРезультат = ПромежуточнаяТабВст.Скопировать(,"ВидВставки, ЗначениеОтклонения");
							
							Для Сч = 1 По КоличествоКамней - 1 Цикл
								МассивУдаления.Добавить(ТЗРезультат[Сч]);						
							КонецЦикла;
							
							Если МассивУдаления.Количество() > 0 Тогда
								Для каждого СтрМ Из МассивУдаления Цикл
									ТЗРезультат.Удалить(СтрМ);
								КонецЦикла;
							КонецЕсли;
							
							Для Сч = 1 По КоличествоКамней - 1 Цикл
								ПромежуточнаяТабВст = ТЗОтнВст.Скопировать();
								ПромежуточнаяТабВст.Удалить(0);
								
								//Добавляем колонку в которую потом загрузим данные нового металла
								ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + Сч);
								
								Для каждого СтрПромежуточная Из ПромежуточнаяТабВст Цикл
									Стр = ТЗРезультат.Получить(0);
									Стр["ЗначениеОтклонения" + Сч] = СтрПромежуточная.ЗначениеОтклонения;
								КонецЦикла;
							КонецЦикла;
						Иначе
							ТЗРезультат = ТЗОтнВст.Скопировать();
						КонецЕсли;
						
						//Заполнение строк
						Для каждого СтрРез Из ТЗРезультат Цикл
							ОбластьСтрокаВставки = Макет.ПолучитьОбласть("СтрокаВ|КолонкаЗаголовок");
							ОбластьСтрокаВставкиДоп = Макет.ПолучитьОбласть("СтрокаВ|КолонкаДоп");
							
							ОбластьСтрокаВставки.Параметры.Камень = СтрРез.ВидВставки.Наименование;
							Результат.Вывести(ОбластьСтрокаВставки);
							
							Если ТЗОтнВст.Количество() > 1 Тогда
								КоличествоКамней = ТЗОтнВст.Количество();
								Для Сч = 0 По КоличествоКамней - 1 Цикл
									Если Сч = 0 Тогда
										ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									Иначе
										ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + Сч];
									КонецЕсли;
									
									Результат.Присоединить(ОбластьСтрокаВставкиДоп);
								КонецЦикла;
							Иначе
								ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
								Результат.Присоединить(ОбластьСтрокаВставкиДоп);
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
				
				Если ТЗАбсСК.Количество() > 0 Тогда
					Для каждого СтрАбсСК Из ТЗАбсСК Цикл
						
						ТЗАбсВст = ТЗАбс.Скопировать();
						
						ОбластьЗаголовокВставки = Макет.ПолучитьОбласть("ЗаголовокВ|КолонкаЗаголовок");
						ОбластьЗаголовокВставки.Параметры.СК = СтрСК.СхемаКредитования.Наименование;
						Результат.Вывести(ОбластьЗаголовокВставки);
						
						НомерКолонки = 2;
						Для каждого СтрВстАбс Из ТЗАбсВст Цикл
							ОбластьЗаголовокВставкиДоп = Макет.ПолучитьОбласть("ЗаголовокВ|КолонкаДоп");
							
							Если НомерКолонки = 2 Тогда
								ОбластьЗаголовокВставкиДоп.Параметры.Отклонение = "Увеличение суммы оценки за 1 карат в руб. от базовой оценки";
							КонецЕсли;
							
							ОбластьЗаголовокВставкиДоп.Параметры.Качество = СтрВстАбс.КачествоОгранки.Наименование;
							ОбластьЗаголовокВставкиДоп.Параметры.ВидОгранки = СтрВстАбс.ВидОгранки.Наименование;
							Результат.Присоединить(ОбластьЗаголовокВставкиДоп);
							
							НомерКолонки = НомерКолонки + 1;
						КонецЦикла;
						
						НомерСтр = Результат.ВысотаТаблицы;
						
						МассивУдаления.Очистить();
						
						Если ТЗАбсВст.Количество() > 1 Тогда
							
							//Результат.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки + ТЗАбсВст.Количество()).Объединить();
							Результат.Область(НомерСтр - 4, 3, НомерСтр - 3, НомерКолонки).Объединить();
							
							ПромежуточнаяТабВст = ТЗАбсВст.Скопировать();
							
							КоличествоКамней = ТЗАбсВст.Количество();
							
							ТЗРезультат = ПромежуточнаяТабВст.Скопировать(,"ВидВставки, ЗначениеОтклонения");
							
							Для Сч = 1 По КоличествоКамней - 1 Цикл
								МассивУдаления.Добавить(ТЗРезультат[Сч]);
							КонецЦикла;
							
							Если МассивУдаления.Количество() > 0 Тогда
								Для каждого СтрМ Из МассивУдаления Цикл
									ТЗРезультат.Удалить(СтрМ);
								КонецЦикла;
							КонецЕсли;
							
							Для Сч = 1 По КоличествоКамней - 1 Цикл
								ПромежуточнаяТабВст = ТЗАбсВст.Скопировать();
								ПромежуточнаяТабВст.Удалить(0);
								
								//Добавляем колонку в которую потом загрузим данные нового металла
								ТЗРезультат.Колонки.Добавить("ЗначениеОтклонения" + Сч);
								
								Для каждого СтрПромежуточная Из ПромежуточнаяТабВст Цикл
									Стр = ТЗРезультат.Получить(0);
									Стр["ЗначениеОтклонения" + Сч] = СтрПромежуточная.ЗначениеОтклонения;
								КонецЦикла;
							КонецЦикла;
						Иначе
							ТЗРезультат = ТЗАбсВст.Скопировать();
						КонецЕсли;
						
						Для каждого СтрРез Из ТЗРезультат Цикл
							ОбластьСтрокаВставки = Макет.ПолучитьОбласть("СтрокаВ|КолонкаЗаголовок");
							ОбластьСтрокаВставкиДоп = Макет.ПолучитьОбласть("СтрокаВ|КолонкаДоп");
							
							ОбластьСтрокаВставки.Параметры.Камень = СтрРез.ВидВставки.Наименование;
							Результат.Вывести(ОбластьСтрокаВставки);
							
							Если ТЗАбсВст.Количество() > 1 Тогда
								КоличествоКамней = ТЗАбсВст.Количество();
								Для Сч = 0 По КоличествоКамней - 1 Цикл
									Если Сч = 0 Тогда
										ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
									Иначе
										ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез["ЗначениеОтклонения" + Сч];
									КонецЕсли;
									
									Результат.Присоединить(ОбластьСтрокаВставкиДоп);
								КонецЦикла;
							Иначе
								ОбластьСтрокаВставкиДоп.Параметры.ЗнчОтклонения = СтрРез.ЗначениеОтклонения;
								Результат.Присоединить(ОбластьСтрокаВставкиДоп);
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Если ДействующийПриказ = Неопределено Тогда
		//	ДатаНачалаПоиска = ДатаНач;
		//Иначе
		//	ДатаНачалаПоиска = ?(НачалоДня(ДействующийПриказ[0].ДатаНачалаДействия) > НачалоДня(ДействующийПриказ[0].ДатаДокумента), ДействующийПриказ[0].ДатаНачалаДействия, ДействующийПриказ[0].ДатаДокумента);
		//КонецЕсли;
		
		//Ломбард = ПолучитьЛомбардСозданияКарточки(ДатаКон, Стр.Залогодатель);
		//Отделение = ?(Ломбард = Неопределено, "", ПолучитьОтделениеЛомбарда(ДатаКон, Ломбард));
		//ДатаРождения = ПолучитьДатуРожденияЗалогодателя(ДатаКон, Стр.Залогодатель);
		
		//ПриказыЗаПериод = ПолучитьПриказыЗаПериод(ДатаНачалаПоиска - 1, ДатаКон, Стр.Залогодатель);
		
		//Если ПриказыЗаПериод <> Неопределено Тогда
		//	Для каждого СтрП Из ПриказыЗаПериод Цикл
		//		
		//		ДатаНачалаПроверки = ?(НачалоДня(СтрП.Регистратор.ДатаНачалаДействияПриказа) > НачалоДня(СтрП.Регистратор.Дата), СтрП.Регистратор.ДатаНачалаДействияПриказа, СтрП.Регистратор.Дата);
		//		ДатаКонцаПроверки = ?(СтрП.Регистратор.ДатаОкончанияДействияПриказа = Дата(1,1,1), ДатаКон, СтрП.Регистратор.ДатаОкончанияДействияПриказа);
		//		
		//		СтруктураПроверки = ПроверитьНаличиеНовыхПриказов(ДатаНачалаПроверки, ДатаКонцаПроверки, Стр.Залогодатель, СтрП.Регистратор, ДатаКон);
		//		
		//		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		//		ОбластьСтрока.Параметры.Отделение = Отделение;
		//		ОбластьСтрока.Параметры.Подразделение = ?(Ломбард = Неопределено, "", "Ломбард № " + Ломбард.НомерЛомбарда);
		//		ОбластьСтрока.Параметры.ФИОЗаемщика = Стр.Залогодатель;
		//		ОбластьСтрока.Параметры.ДатаРождения = СтрП.ДатаРождения; //?(ДатаРождения = Неопределено, "", ДатаРождения);
		//		ОбластьСтрока.Параметры.ДатаНачалаДействияСтатуса = СтрП.ДатаНачалаДействия;
		//		ОбластьСтрока.Параметры.ДатаОкончанияДействияСтатуса = ?(СтрП.ДатаОкончанияДействия = Дата(1,1,1), "-", СтрП.ДатаОкончанияДействия);
		//		//ОбластьСтрока.Параметры.НомерПриказа = "№ " + Стр.Регистратор.НомерПриказа + " от " + Формат(Стр.Период, "ДФ=dd.MM.yyyy");
		//		ОбластьСтрока.Параметры.НомерПриказа = "№ " + СтрП.Регистратор.НомерПриказа + " от " + СтрП.Период;
		//		ОбластьСтрока.Параметры.ДокПриказа = СтрП.Регистратор;
		//		//ОбластьСтрока.Параметры.ДатаПрисвоенияФИОИсполнителя = "" + Стр.Период + " "
		//		//	+ ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Стр.Регистратор.Ответственный.Сотрудник.Наименование);
		//		ОбластьСтрока.Параметры.ДатаПрисвоенияФИОИсполнителя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрП.Регистратор.Ответственный.Сотрудник.Наименование);
		//		
		//		//ОбластьСтрока.Параметры.ТекущееСостояниеСтатуса = ?(Стр.РегистраторВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП, "Действует",
		//		//	"Досрочно прекращен");
		//		ОбластьСтрока.Параметры.ТекущееСостояниеСтатуса = СтруктураПроверки.Состояние;
		//		
		//		//ОбластьСтрока.Параметры.ДатаИзмененияФИОИсполнителя = ?(Стр.РегистраторВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП,
		//		//"" + Стр.Регистратор.Дата + " " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Стр.Регистратор.Ответственный.Сотрудник.Наименование), "");
		//		ОбластьСтрока.Параметры.ДатаИзмененияФИОИсполнителя = СтруктураПроверки.ТекстПриказы;
		//		
		//		ОбластьСтрока.Параметры.ИдивидуальныеУсловия = СтрП.Регистратор.Комментарий;
		//		
		//		Результат.Вывести(ОбластьСтрока);
		//	КонецЦикла;
		//КонецЕсли;
	//КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура Интервал(Команда)
//	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
//	
//	Если ДиалогРедактирования.Редактировать() Тогда
//		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
//		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьЛомбардСозданияКарточки(Дата, Залогодатель)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 1
//		|	ЛБ_РасчетыСКлиентамиБУОбороты.Ломбард КАК Ломбард
//		|ИЗ
//		|	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.Обороты(, &Дата, Регистратор, Клиент = &Залогодатель) КАК ЛБ_РасчетыСКлиентамиБУОбороты
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ЛБ_РасчетыСКлиентамиБУОбороты.Период";
//	
//	Запрос.УстановитьПараметр("Дата", Дата);
//	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выбрать();
//	
//	Если РезультатЗапроса.Следующий() Тогда
//		Возврат РезультатЗапроса.Ломбард;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции

&НаСервере
Функция ПолучитьДатуРожденияЗалогодателя(Дата, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ДатаРождения
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОтделениеЛомбарда(Дата, Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Отделение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Документ", Расшифровка);
		
		ФормаЗ = ПолучитьФорму("ОбщаяФорма.ЛБ_ЖурналПриказовПоЗалогодателям", ПараметрыФормы,, Новый УникальныйИдентификатор());
		ФормаЗ.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеНовыхПриказов(ДатаНач, ДатаКон, Залогодатель, ПриказУстановки, ДатаОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ПриказУстановки);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый Структура("ТекстПриказы, Состояние");

	ТекстП = "";
	
	МассивУдаленияСтрок = Новый Массив;
	
	ТЗСтавки = ПриказУстановки.СтавкиПроцентов.Выгрузить(, "Ставка");
	
	Для каждого СтрС Из ТЗСтавки Цикл
		Если СтрС.Ставка = 0 Тогда
			МассивУдаленияСтрок.Добавить(СтрС);
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивУдаленияСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивУдаленияСтрок Цикл
			ТЗСтавки.Удалить(СтрМ);
		КонецЦикла;
	КонецЕсли;

	УстановленныСтавки = ТЗСтавки.Количество() > 0;
	УстановленныМеталлы = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
	УстановленныВставки = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;

	Для каждого Стр Из РезультатЗапроса Цикл
		Ставки = Ложь;
		Металлы = Ложь;
		Вставки = Ложь;
	
		Если УстановленныСтавки Тогда
			Если Стр.Регистратор.СтавкиПроцентов.Количество() > 0 Тогда
					
					ТЗСтавки.Очистить();
					МассивУдаленияСтрок.Очистить();
					
					ТЗСтавки = Стр.Регистратор.СтавкиПроцентов.Выгрузить(, "Ставка");
					
					Для каждого СтрТЗ Из ТЗСтавки Цикл
						Если СтрТЗ.Ставка = 0 Тогда
							МассивУдаленияСтрок.Добавить(СтрТЗ);
						КонецЕсли;			
					КонецЦикла;
					
					Если МассивУдаленияСтрок.Количество() > 0 Тогда
						Для каждого СтрМ Из МассивУдаленияСтрок Цикл
							ТЗСтавки.Удалить(СтрМ);
						КонецЦикла;
					КонецЕсли;

					Если ТЗСтавки.Количество() > 0 Тогда
						УстановленныСтавки = НЕ ТЗСтавки.Количество() > 0;
						Ставки = Истина;
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныМеталлы Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
				УстановленныМеталлы = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
				Металлы = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныВставки Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
				УстановленныВставки = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
				Вставки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		//Если Стр.Регистратор.СтавкиПроцентов.Количество() > 0 ИЛИ
		//	Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 ИЛИ
		//	Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
		Если Ставки ИЛИ Металлы ИЛИ Вставки Тогда
			
			//ТекстП = ?(ТекстП = "",
			//"" + Стр.Регистратор.Дата + " " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Стр.Регистратор.Ответственный.Сотрудник.Наименование),
			//ТекстП + ", " + Стр.Регистратор.Дата + " " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Стр.Регистратор.Ответственный.Сотрудник.Наименование));

			ТекстП = ?(ТекстП = "", "", ТекстП + ", " + Символы.ПС);
			
			Если Стр.Регистратор.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ОтменитьВИП Тогда
				ТекстП = ТекстП + "Пр. Отм №";
			Иначе
				ТекстП = ТекстП + "Пр. №";
			КонецЕсли;
			
			ТекстП = ТекстП + Стр.Регистратор.НомерПриказа + " от " + Формат(Стр.Регистратор.Дата, "ДФ=dd.MM.yyyy") + " ("
			+ ?(Ставки, "Ст.", "")
			+ ?(Металлы, ?(Ставки, ", Мет.", "Мет."), "")
			+ ?(Вставки, ?(Ставки ИЛИ Металлы, ", Вст.)", "Вст.)"), ")");

			Если ТекстП <> "" Тогда
				ТекстП = ТекстП + " " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Стр.Регистратор.Ответственный.Сотрудник.Наименование);
			КонецЕсли;			
		КонецЕсли;
		
		Если НЕ УстановленныСтавки И НЕ УстановленныМеталлы И НЕ УстановленныВставки Тогда
			
			СтруктураВозврата.ТекстПриказы = ТекстП;
			СтруктураВозврата.Состояние = "Досрочно прекращен";
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.ТекстПриказы = ТекстП;
	
	Если ПриказУстановки.ДатаОкончанияДействияПриказа <> Дата(1,1,1)
		И ПриказУстановки.ДатаОкончанияДействияПриказа <= ДатаОтчета Тогда
							
		СтруктураВозврата.Состояние = "Срок действия истек";
	Иначе
		СтруктураВозврата.Состояние = "Действует";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗалогодателей(ДатаКон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель КАК Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель.Наименование КАК ЗалогодательНаименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалогодательНаименование";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТЗВозврата = РезультатЗапроса.Скопировать(,"Залогодатель");
	ТЗВозврата.Свернуть("Залогодатель");
	
	Если ТЗВозврата.Количество() > 0 Тогда
		Возврат ТЗВозврата;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиДействующийПриказ(ДатаКон, Залогодатель)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Ставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Металлы
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Вставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Ставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиСорт
	               |ИЗ
	               |	Ставки КАК Ставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Ставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Металлы.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыСорт
	               |ИЗ
	               |	Металлы КАК Металлы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Металлы.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Вставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиСорт
	               |ИЗ
	               |	Вставки КАК Вставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Вставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиПерв
	               |ИЗ
	               |	СтавкиСорт КАК СтавкиСорт
	               |ГДЕ
	               |	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ СтавкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МеталыСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыПерв
	               |ИЗ
	               |	МеталыСорт КАК МеталыСорт
	               |ГДЕ
	               |	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ МеталыСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВставкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиПерв
	               |ИЗ
	               |	ВставкиСорт КАК ВставкиСорт
	               |ГДЕ
	               |	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ ВставкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиПерв.Регистратор КАК Приказ,
	               |	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
	               |	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
	               |	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
	               |	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
	               |	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
	               |	ИСТИНА КАК Ставки,
	               |	ЛОЖЬ КАК Металлы,
	               |	ЛОЖЬ КАК Вставки
	               |ПОМЕСТИТЬ Общая
	               |ИЗ
	               |	СтавкиПерв КАК СтавкиПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	МеталыПерв.Регистратор,
	               |	МеталыПерв.Регистратор.НомерПриказа,
	               |	МеталыПерв.Регистратор.НомерСистемныйЧисло,
	               |	МеталыПерв.Регистратор.Дата,
	               |	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ИСТИНА,
	               |	ЛОЖЬ
	               |ИЗ
	               |	МеталыПерв КАК МеталыПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВставкиПерв.Регистратор,
	               |	ВставкиПерв.Регистратор.НомерПриказа,
	               |	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
	               |	ВставкиПерв.Регистратор.Дата,
	               |	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ИСТИНА
	               |ИЗ
	               |	ВставкиПерв КАК ВставкиПерв
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Общая.Приказ КАК Приказ,
	               |	Общая.НомерПриказа КАК НомерПриказа,
	               |	Общая.СистемныйНомер КАК СистемныйНомер,
	               |	Общая.ДатаДокумента КАК ДатаДокумента,
	               |	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	               |	МАКСИМУМ(Общая.Ставки) КАК Ставки,
	               |	МАКСИМУМ(Общая.Металлы) КАК Металлы,
	               |	МАКСИМУМ(Общая.Вставки) КАК Вставки
	               |ИЗ
	               |	Общая КАК Общая
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Общая.Приказ,
	               |	Общая.НомерПриказа,
	               |	Общая.ДатаДокумента,
	               |	Общая.ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия,
	               |	Общая.СистемныйНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачалаДействия,
	               |	ДатаДокумента";

	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);	

	Запрос.УстановитьПараметр("Дата", ДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьПриказыЗаПериод(ДатаНач, ДатаКон, Залогодатель)
	Запрос = Новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель КАК Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации КАК РегистраторВидОперации,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Залогодатель КАК Залогодатель,
		|	ВТ.Регистратор КАК Регистратор,
		|	ВТ.РегистраторВидОперации КАК РегистраторВидОперации,
		|	ВТ.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ВТ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ВТ.Период КАК Период,
		|	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&ДатаКон, ) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
		|		ПО ВТ.Залогодатель = ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия УБЫВ,
		|	Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции
